//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЕстьЧеловекСДатойРождения(Парам01)","ЕстьЧеловекСДатойРождения","Допустим есть человек с датой рождения 02.11.1994");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"Сегодня(Парам01)","Сегодня","Когда сегодня 20.08.2016");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЕгоВозрастВМесяцахБудетРавен(Парам01)","ЕгоВозрастВМесяцахБудетРавен","Тогда его возраст в месяцах будет равен 261");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим есть человек с датой рождения 02.11.1994
//@ЕстьЧеловекСДатойРождения(Парам01)
Процедура ЕстьЧеловекСДатойРождения(ДатаРождения) Экспорт
	Контекст.Вставить("ДатаРождения", ДатаРождения);
КонецПроцедуры

&НаКлиенте
//Когда сегодня 20.08.2016
//@Сегодня(Парам01)
Процедура Сегодня(ТекущаяДата) Экспорт
	Контекст.Вставить("ТекущаяДата", ТекущаяДата);
КонецПроцедуры

&НаКлиенте
//Тогда его возраст в месяцах будет равен 261
//@ЕгоВозрастВМесяцахБудетРавен(Парам01)
Процедура ЕгоВозрастВМесяцахБудетРавен(ОжидаемыйВозраст) Экспорт
	Возраст = ОбщийМодуль1.ПолучитьВозрастВМесяцах(НачалоДня(Контекст.ДатаРождения), Контекст.ТекущаяДата);
	Если Возраст <> ОжидаемыйВозраст Тогда
		ВызватьИсключение "fail";
	КонецЕсли;
КонецПроцедуры

//окончание текста модуля